Repository: NetAngels/whois2
Catalog: locale/*/LC_MESSAGES/whois2.po
Languages: ru

source: invalid domain name
ru: неверное доменное имя

source: there are no rules to handle .{} domains
ru: нет правил для обработки доменов .{}

source: pick 2nd level domain. domain.tld, not www.domain.tld
ru: Укажите домен второго уровня. domain.ru, а не www.domain.ru

source: domains must contain letters, numbers and a "-" sign only
ru: домены могут содержать только русские буквы, цифры и символ "-"

source: domain cannot starts or ends with "-" sign
ru: домены не могут начинаться или заканчиваться символом "-"

source: IDNA domains are forbidden in .{} domain
ru: В зоне .{} запрещены домены IDNA

source: domain names shorter than 3 letter are forbidden in .{}
ru: доменные имена короче 3 символов запрещены в .{}

source: domain names shorter than 2 letter are forbidden in .{}
ru: доменные имена короче 2 символов запрещены в .{}

source: RF domain must contain at least 2 symbols
ru: домены РФ должны иметь как минимум два символа

source: IDNA representation of the domain contains more than 63 symbols
ru: IDNA-представление домена содержит более 63 символов

source: RF domain must contain only russian letters, numbers and a "-" sign
ru: домены РФ должны содержать только русские буквы, цифры и символ "-"

source: don't show the whole information, just the registration status
ru: не показывать всю информацию, а только состояние зарегистированности

source: show info about current domain in every top domain
ru: показать информацию об этом домене в каждом домене верхнего уровня

source: ignore registered domains
ru: игнорировать зарегистрированные домены

source: ignore unregistered domains
ru: игнорировать незарегистрированные доменыв

source: ignore invalid domains
ru: игнорировать некорректные домены

source: timeout between whois queries
ru: ожидание между запросами к whois

source: number of simultaneous whois processes
ru: количество одновременно выполняющихся процессов whois

source: Runtime Error: {}
ru: Ошибка времени выполнения: {}

source: Domain is free to register
ru: Домен свободен для регистрации
